# Parameter Type Id Assembly Code Property

Source: https://www.revitapidocs.com/2026/27628057-420e-8e70-cc2e-c1b3d6c4efcd.htm

---

| Parameter Type Id Assembly Code Property |
| --- |

"Assembly Code"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId AssemblyCode { get; }
```

```
Public Shared ReadOnly Property AssemblyCode As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ AssemblyCode {
	ForgeTypeId^ get ();
}
```

```
static member AssemblyCode : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace